# IExternalEventHandler Methods

---
The IExternalEventHandler type exposes the following members.
| Name| Description
---|---|---
| Execute|  This method is called to handle the external event.
| GetName|  String identification of the event handler.
Top
#### Reference
IExternalEventHandler Interface
Autodesk.Revit.UI Namespace